Autodesk.Revit.DB.ConnectionWarning
Since:
2016
An enumerated type listing all the reasons for connectivity failure.
Since:
2016

Autodesk.Revit.DB.ConnectionWarning.Connectivity
Value for fabrication Connectivity Mismatch.

Autodesk.Revit.DB.ConnectionWarning.Shape
Value for shapes didn't match.

Autodesk.Revit.DB.ConnectionWarning.Size
Value for sizes didn't match.

Autodesk.Revit.DB.ConnectionWarning.Alignment
Value for parts were moved when rebuilt so that connectors were no longer aligned.

Autodesk.Revit.DB.ConnectionWarning.Unknown
Value for unknown or unspecified reason.